const rank = require('../dist/rank').default

test('raw type', function () {
    let data = [
        ['白色', '黑色', '灰色'],
        ['S', 'M', 'L'],
        ['真皮', '尼龙']
    ]
    let ret = rank(data, 'item')
    expect(ret).toEqual([
        ['白色', 'S', '真皮'],
        ['白色', 'S', '尼龙'],
        ['白色', 'M', '真皮'],
        ['白色', 'M', '尼龙'],
        ['白色', 'L', '真皮'],
        ['白色', 'L', '尼龙'],
        ['黑色', 'S', '真皮'],
        ['黑色', 'S', '尼龙'],
        ['黑色', 'M', '真皮'],
        ['黑色', 'M', '尼龙'],
        ['黑色', 'L', '真皮'],
        ['黑色', 'L', '尼龙'],
        ['灰色', 'S', '真皮'],
        ['灰色', 'S', '尼龙'],
        ['灰色', 'M', '真皮'],
        ['灰色', 'M', '尼龙'],
        ['灰色', 'L', '真皮'],
        ['灰色', 'L', '尼龙']
    ])
})